import org.apache.commons.text.similarity.LevenshteinDistance
import java.util.*

fun main() {
    Catalog.initialize()
    val maxDistance = 10
    val x = LevenshteinDistance(maxDistance)
//    val scope = CoroutineScope(SupervisorJob())
    val list = Collections.synchronizedList(mutableListOf<Triple<String, String, Int>>())
//    val atomicInteger = AtomicInteger()
    var counter = 0
//    runBlocking {
    outer@ for (it1 in Catalog.entries) {
        for (it2 in Catalog.entries) {
//                scope.launch {
            log(counter++)
            if (x.apply(it1.seferName, it2.seferName) < maxDistance && list.size < 100) log(it1.seferName + " and " + it2.seferName)
            else break@outer
//                }
        }
    }//.joinAll()
    log(list.sortedByDescending { it.third }.take(100))
//    }
}/*{
//    Lemmatizer().testGetLemmas()
    val result = lemmatizer.getLemmatizedList(
        "למד" +
                " לימד" +
                " ילמד" +
                " נלמד" +
                " נלמדה" +
                " ילמדו" +
                " תלמד" +
                " תלמדי" +
                " מלמד" +
                " שלימד" +
                " שלמד" +
                " שלמדו" +
                "למדו" +
                "לומדים" +
                "לומדות" +
                "ילמדנו" +
                "תלמדו" +
                "תלמדנה" +
                "תלמוד" +
                "התלמד" +
                "נתלמד" +
                "נתלמדו" +
                "התלמדו" +
                "למדני" +
                "למדנו" +
                "נתלמדנו" +
                "נתלמדו" +
                "התלמדו",
        true,
        true
    )
    log(result)
    log()
    log()
    log()
    log()

    val result1 = lemmatizer.getLemmatizedList(
        "אמר" +
                " אימר" +
                " נאמר" +
                " נאמרה" +
                " יאמר" +
                " אמרה" +
                " יאמרו" +
                " תאמר" +
                " תאמרי" +
                " מאמר" +
                " שאימר" +
                " אימרה" +
                " אמירה" +
                " שאמר" +
                " שאמרו" +
                "אמרו" +
                "אומרו" +
                "אומרות" +
                "אומרים" +
                "תאמרו" +
                "תאמרנה" +
                "תאמור" +
                "התאמר" +
                "נתאמר" +
                "נתאמרו" +
                "התאמרו" +
                "אמרני" +
                "אמרנו" +
                "נתאמרנו" +
                "נתאמרו" +
                "התאמרו",
        true,
        true
    )
    log()
    log(result1)
    log()
    log()
    log()
    log()

    val result2 = lemmatizer.getLemmatizedList(
        "עקר" +
                " עיקר" +
                " נעקר" +
                " נעקרה" +
                " יעקר" +
                " יעקרו" +
                " עוקרו" +
                " עוקרים" +
                " עוקרות" +
                " עקרה" +
                " תעקר" +
                " תעקרי" +
                " מעקר" +
                " שעיקר" +
                " שעיקרו" +
                " שעקר" +
                " שעקרו" +
                "עקרו" +
                "תעקרו" +
                "תעקרנה" +
                "תעקור" +
                "התעקר" +
                "נתעקר" +
                "נתעקרו" +
                "התעקרנו" +
                "עקרני" +
                "עקרנו" +
                "עיקרנו" +
                "נתעקרנו" +
                "נתעקרו" +
                "התעקרו",
        true,
        true
    )
    log()
    log(result2)
    log("Madad: " + lemmatizer.getLemmatizedList(" מודדים מודדו מודדות מדד מודד מדדו למדוד למודד מדדו ימודדו ימודד", false, true,))
    log("mamar: " + lemmatizer.getLemmatizedList("מאמר וממאמר וממאמרי וממאמרים ומאמרותיהם וממאמריהם וממאמרותהם", true, true,))
    log("lamad: " + lemmatizer.getLemmatizedList(" ילמדינו ילמדנו", true, true,))//TODO fails
    log("atar: " + lemmatizer.getLemmatizedList(" עיטור", true, true,))
    log("hatar: " + lemmatizer.getLemmatizedList(" העטרה ", true, true,))
    log("batar: " + lemmatizer.getLemmatizedList(" בעטר", true, true,))
    log("batar: " + lemmatizer.getLemmatizedList(" מעטר", true, true,))
    log("batar: " + lemmatizer.getLemmatizedList("א. מחברת מנחם / ב. תשובות דונש / ג. תשובות תלמידי מנחם / ד. תשובות דונש על רס״ג", true, true,))
    log("---------------------")
    log("batar: " + lemmatizer.getLemmatizedList("בגבורה", true, true,))
    log("---------------------")
    log("batar: " + lemmatizer.getLemmatizedList("בגבורתו", true, true,))
//    log("adjectives: " + lemmatizer.getLemmatizedList(" יפיפיה מפואר נהדר מדהים נאזר עטוף אדום כחול אדיר אמור", true, true,))//TODO fails
}*/
//after sanitization: (?!(למד|אמר|עקר))
//[(ארבעה טורים השלם - אבן העזר -- א -- א - צה   (מהדורת י״ב כרכים)
// ארבעה טורים השלם - אורח חיים -- א -- א - רמא  (מהדורת י״ב כרכים)
// 10)
// (ארבעה טורים השלם - אבן העזר -- א -- א - צה   (מהדורת י״ב כרכים)
// ארבעה טורים השלם - יורה דעה -- א -- א - קלד  (מהדורת י״ב כרכים)
// 10)
// (ארבעה טורים השלם - אורח חיים -- א -- א - רמא  (מהדורת י״ב כרכים)
// ארבעה טורים השלם - אבן העזר -- א -- א - צה   (מהדורת י״ב כרכים)
// 10)
// (ארבעה טורים השלם - יורה דעה -- א -- א - קלד  (מהדורת י״ב כרכים)
// ארבעה טורים השלם - אבן העזר -- א -- א - צה   (מהדורת י״ב כרכים)
// 10)
// (ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// 10)
// (ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// 10)
// (ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// 10)
// (ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// 10)
// (ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// 10)
// (ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// 10)
// (ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם -  אבן העזר -- א -- א-סה
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// 10)
// (ארבעה טורים השלם -  יורה דעה -- א -- א - ס
// ארבעה טורים השלם - אורח חיים -- א -- א - קכז
// 10)
// (ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// 10)
// (ארבעה טורים השלם -  יורה דעה -- ג -- קיב - קפב
// ארבעה טורים השלם -  אבן העזר -- ג -- קיט - קעח
// 10)
// (שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// שלחן ערוך החדש - חושן משפט -- א -- א - עד
// 10)
// (שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// שלחן ערוך החדש - חושן משפט -- א -- א - עד
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך השלם - אורח חיים -- ו  -- תכט - תצד
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך השלם -  אורח חיים -- א -- א - נז
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך השלם - אורח חיים -- ג -- קנ - רמא
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך -  אורח חיים -- ה -- שמה - תכח
// 10)
// (שלחן ערוך החדש - אורח חיים -- ג -- תיז - תרצז
// שלחן ערוך -  אורח חיים -- ו -- תכט - תצד
// 10)
// (שלחן ערוך החדש - אורח חיים -- ג -- תיז - תרצז
// שלחן ערוך -  אורח חיים -- ח -- תקפא -תרצז
// 10)
// (שלחן ערוך החדש - חושן משפט -- א -- א - עד
// שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// 10)
// (שלחן ערוך החדש - חושן משפט -- א -- א - עד
// שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// 10)
// (שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// 10)
// (שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- ד -- פז - קיא
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- א -- א - כח
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- ג -- סא - פו
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- ה -- קנט - קפב
// 10)
// (שלחן ערוך החדש - יורה דעה -- ג -- קכג - רב
// שלחן ערוך - יורה דעה -- ג -- סא - פו
// 10)
// (שלחן ערוך החדש - יורה דעה -- ג -- קכג - רב
// שלחן ערוך - יורה דעה -- ה -- קנט - קפב
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ד -- פז - קיא
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- א -- א - כח
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ג -- סא - פו
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ו -- קפג - רב
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ח -- ער - שלג
// 10)
// (שלחן ערוך - אבן העזר -- א - כה
// שלחן ערוך - חשן משפט -- רמא - רצ
// 10)
// (שלחן ערוך - אבן העזר -- סו - קיח
// שלחן ערוך - חשן משפט -- צז - קלב
// 10)
// (שלחן ערוך - אבן העזר -- סו - קיח
// שלחן ערוך - חשן משפט -- צז - קלב
// 10)
// (שלחן ערוך - אבן העזר -- סו - קיח
// שלחן ערוך - חשן משפט -- קלג - קפח
// 10)
// (שלחן ערוך - אבן העזר -- קיט - קלט
// שלחן ערוך - חשן משפט -- צז - קלב
// 10)
// (שלחן ערוך - אבן העזר -- קיט - קלט
// שלחן ערוך - חשן משפט -- צז - קלב
// 10)
// (שלחן ערוך - אבן העזר -- קיט - קלט
// שלחן ערוך - חשן משפט -- קלג - קפח
// 10)
// (שלחן ערוך - אבן העזר -- קיט - קלט
// שלחן ערוך - חשן משפט -- קפט - רמ
// 10)
// (שלחן ערוך - חשן משפט -- צז - קלב
// שלחן ערוך - אבן העזר -- סו - קיח
// 10)
// (שלחן ערוך - חשן משפט -- צז - קלב
// שלחן ערוך - אבן העזר -- קיט - קלט
// 10)
// (שלחן ערוך - חשן משפט -- צז - קלב
// שלחן ערוך - אבן העזר -- קמ - קעח
// 10)
// (שלחן ערוך - חשן משפט -- צז - קלב
// שלחן ערוך - אבן העזר -- סו - קיח
// 10)
// (שלחן ערוך - חשן משפט -- צז - קלב
// שלחן ערוך - אבן העזר -- קיט - קלט
// 10)
// (שלחן ערוך - חשן משפט -- צז - קלב
// שלחן ערוך - אבן העזר -- קמ - קעח
// 10)
// (שלחן ערוך - חשן משפט -- קלג - קפח
// שלחן ערוך - אבן העזר -- סו - קיח
// 10)
// (שלחן ערוך - חשן משפט -- קלג - קפח
// שלחן ערוך - אבן העזר -- קיט - קלט
// 10)
// (שלחן ערוך - חשן משפט -- קפט - רמ
// שלחן ערוך - אבן העזר -- קיט - קלט
// 10)
// (שלחן ערוך - חשן משפט -- רמא - רצ
// שלחן ערוך - אבן העזר -- א - כה
// 10)
// (שלחן ערוך - אבן העזר -- קמ - קעח
// שלחן ערוך - חשן משפט -- צז - קלב
// 10)
// (שלחן ערוך - אבן העזר -- קמ - קעח
// שלחן ערוך - חשן משפט -- צז - קלב
// 10)
// (שלחן ערוך - אבן העזר -- קמ - קעח
// שלחן ערוך אבן העזר השלם -- קל - קנד
// 10)
// (שלחן ערוך השלם - אורח חיים -- ו  -- תכט - תצד
// שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// 10)
// (שלחן ערוך השלם - אורח חיים -- ו  -- תכט - תצד
// שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// 10)
// (שלחן ערוך החדש - אורח חיים -- ג -- תיז - תרצז
// שלחן ערוך -  אורח חיים -- ו -- תכט - תצד
// 10)
// (שלחן ערוך החדש - אורח חיים -- ג -- תיז - תרצז
// שלחן ערוך -  אורח חיים -- ח -- תקפא -תרצז
// 10)
// (שלחן ערוך החדש - יורה דעה -- ג -- קכג - רב
// שלחן ערוך - יורה דעה -- ג -- סא - פו
// 10)
// (שלחן ערוך החדש - יורה דעה -- ג -- קכג - רב
// שלחן ערוך - יורה דעה -- ה -- קנט - קפב
// 10)
// (שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// שלחן ערוך החדש - חושן משפט -- א -- א - עד
// 10)
// (שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// שלחן ערוך החדש - חושן משפט -- א -- א - עד
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- ד -- פז - קיא
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- א -- א - כח
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- ג -- סא - פו
// 10)
// (שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// שלחן ערוך - יורה דעה -- ה -- קנט - קפב
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ד -- פז - קיא
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- א -- א - כח
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ג -- סא - פו
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ו -- קפג - רב
// 10)
// (שלחן ערוך החדש - יורה דעה -- ד -- רג - תג
// שלחן ערוך - יורה דעה -- ח -- ער - שלג
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך השלם - אורח חיים -- ו  -- תכט - תצד
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך השלם -  אורח חיים -- א -- א - נז
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך השלם - אורח חיים -- ג -- קנ - רמא
// 10)
// (שלחן ערוך החדש - אורח חיים -- ב -- רמב - תטז
// שלחן ערוך -  אורח חיים -- ה -- שמה - תכח
// 10)
// (שלחן ערוך החדש - חושן משפט -- א -- א - עד
// שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// 10)
// (שלחן ערוך החדש - חושן משפט -- א -- א - עד
// שלחן ערוך החדש - אורח חיים -- א -- א - רמא
// 10)
// (שלחן ערוך החדש - חושן משפט -- ב -- עה - קע
// שלחן ערוך החדש - יורה דעה -- ב -- סה - קכב
// 10)]